Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: # print a piece of SVG that represents a rectangle
ja: # 長方形を表すSVGを出力する

source: $count, so the question mark goes directly after the second asterisk.)
ja: $countです。なのでクエスチョンマークは直接第2のアスタリスクを求めます）

source: (next without a label is purely dynamic.) Lexotic and dynamic control flow is implemented by a system of control exceptions.
ja: （ラベルなしのnextは純粋に動的だ。） レギゾチックとダイナミックな制御フローは制御例外としてシステムによって実装される。

source: (All normal types in Perl may be evaluated for truth.
ja: （Perlのすべての通常の型は真偽のために評価されるだろう。）

source: (Always assuming the user expects the right thing, of course...) In particular, if the user labels a loop with a specific label, and calls a loop control from within the lexical scope of that loop, and if that call mentions the outer loop's label, then that outer loop is the one that must be controlled.
ja: （ユーザーが常に仮定するのは正しいことだ。もちろん）特に、特定のラベルでユーザーがループにラベルを付けるなら、そしてループ制御をそのレキシカルスコープ内でよぶなら、そしてその呼出しが外側のループのラベルを言及するなら、制御されなければならない外側のループは一つだ。

source: (Assignment of () leaves it defined.)
ja: （()の割り当ては定義されています。）

source: (By similar reasoning, an unless allows binding of a false parameter.)
ja: （似た理由で、unless偽のパラメータのバインディングを許可する。）

source: (Contrast with a non-conditional statement such as:
ja: （条件付きでない文の対比はこのようになる：

source: (FLAT is an acronym meaning Flat Lists Are Typical.
ja: （FLATはFlat Lists Are Typicalの頭文字だ

source: (If bare statements were allowed, the temporary binding of $_ would leak out past the end of the CATCH or CONTROL, with unpredictable and quite possibly dire consequences.
ja: （もし裸の文が許可されるなら、$_の一時的なバインディングはCATCHまたは CONTROLの終端をすぎてリークする。予測できず、まったく緊急かもしれない結果を伴って。

source: (If that is not the block you wish to leave, you must use the LABEL.leave method (or some other control exception such as return or next) to be more specific, since the compiler may find it difficult to guess which surrounding construct was intended as the actual topicalizer.) The value of the inner block is returned as the value of the outer block.
ja: （もしそれが抜けたくないブロックなら、より明確にするためにLABEL.leaveメソッド（またはreturnかnextのようないくつかの他の制御例外）を使わなければならない。 だからコンパイラが実際のトピカライザーとして意図される周囲の構成物がどれか推測するのは難しいだろう。） 内側のブロックの値は外側のブロックの値として返される。

source: (If the LINE is not visible, it would have been caught earlier at compile time since LINE would likely be a bareword.)
ja: （もしLINEが見えないなら、 LINEが裸のワードのようになるまでコンパイル時に早期にキャッチされる。）

source: (In other words, it's lexotic.) If the LINE label is visible but you aren't actually in a dynamic scope controlled by that label, an exception is thrown.
ja: （言い換えれば、それはレギゾチックだ。）もしLINEラベルが可視だが実際にはラベルによって制御されたダイナミックスコープにいるなら、例外がスローされる。

source: (In other words, there is an implicit .die just inside the end of the CATCH block.
ja: （言い換えれば、CATCHブロックの内部の終端に暗黙の.dieがあるだけだ。

source: (Initialization of ordinary variables does not count--presumably the presence of a label will prevent code-movement optimizations past the label.) So, for instance, it's always possible to goto into the next case of a when or into either the "then" or "else" branch of a conditional.
ja: （普通の変数の初期化はカウントしない―多分、ラベルの存在はラベルを過ぎるcode-movement最適化を防ぐだろう。）なので、例えば、gotoで次のケースのwhenか「then」または「else」の条件分岐に飛ぶことは常に可能だ。

source: (It is erroneous to depend on this order if the module is used more than once, however, since the phasers are only installed the first time they're noticed.)
ja: （モジュールが2回以上使われるなら、この順番に頼るのは間違いだ。しかしながら、phasersはそれらが初めて気づいた時だけインストールされる。）

source: (More generally, any container has a container type, including subroutines and modules.) The of type is stored as its of property, while the container type of the container is just the object type of the container itself.
ja: （より一般化すると、どのようなコンテナもコンテナ型を持っています。それはサブルーチンとモジュールも含みます。）of型はofプロパティとして保存されます。コンテナの型はコンテナ自身のただのオブジェクト型です。

source: (Note that both of these scans are done at compile time; if the scans fail, it's a compile-time semantic error.) Typically, such an outer block will be the block of a given or a for statement, but any block that sets the topic can be broken out of.
ja: （両方のスキャンはコンパイル時に行われるので注意；もしスキャンが失敗したら、コンパイル時セマンティックエラーだ。）典型的には、そのようなブロックはgivenかfor文のブロックだろう。しかしトピックをセットするどんなブロックでも脱出できる。

source: (Note that fatal exception types can do the Resumable role even if thrown via fail()--when uncaught they just hit the outermost fatal handler instead of the outermost warning handler, so some inner scope has to explicitly treat them as warnings and resume them.)
ja: 致命的な例外型はfail()経由でスローされてもResumableロールを行えるので注意―キャッチされない時は最も外側の警告ハンドラの代わりに最も外側の致命的ハンドラをヒットするだけなので、いくつかの内側のスコープはそれらを警告と、それらを再会するとして明示的に扱う必要がある。

source: (Note that, unlike C's idea of "falling through", subsequent when conditions are evaluated.
ja: （C言語の「フォールスルー」の考えと違い、その後に続くwhenの条件は評価される。

source: (Note the caller can vary from call to call!)
ja: （呼び出し元は呼び出しごとに変わることに注意！）

source: (Note, however, that the value of a variable calculated at compile time may not persist under run-time cloning of any surrounding closure.)
ja: （注意、けれども、コンパイル時に計算される変数の値はなにか一つの周囲のクロージャの実行時の複製まで残存しないだろう。）

source: (Note: the implicit default binding of an outer $_ to an inner $_ can be emulated for a bare block, so that doesn't fall under the prohibition on bypassing formal binding.)
ja: （注意：外側の$_の暗黙のデフォルトのバインディングから内側の$_は裸のブロックのためにエミュレートできる。それゆえそれは正式のバインディングのバイパスの禁止に該当しない。）

source: (Or we use push semantics and $! means @![*-1].) This might be more robust than merely making @! a parameter to CATCH.
ja: （または我々はpushセマンティクスを使い、$!は@![*-1]を意味する。）これは単に@!をCATCHへのパラメータにするより強いかもしれない。

source: (Otherwise any die would cause an infinite loop.) Instead we treasure them up and rethrow them to a handler further up.
ja: （さもなければdieは無限ループを引き起こすだろう。）その代わりとして我々はそれらを取っておき、さらに上のハンドラに再スローする。

source: (Perl 6's eval function only evaluates strings, not blocks, and does not catch exceptions.) A try block by default has a CATCH block that handles all fatal exceptions by ignoring them.
ja: （Perl 6のeval関数はブロックではなく文字列だけを評価し、例外をキャッチしない。）tryブロックはデフォルトでは全ての致命的な例外を無視するように扱うCATCHブロックを持つ。

source: (See Definition of Success below for more.) temp and let temporize or hypotheticalize the value or the variable depending on whether you do assignment or binding.
ja: （以下、詳細は成功の定義を参照）tempとletはあなたが割り当てるかバインドするかどうかに依存して値か変数を一時的にするか仮定する。

source: (See below.)
ja: （以下を参照。）

source: (That is, in the abstract, they're all anonymous subroutines that take a snapshot of their lexical environment.) How a block is invoked and how its results are used are matters of context, but closures all work the same on the inside.
ja: （それは抽象的には、それらは全てレキシカル環境のスナップショットを撮る無名サブルーチンだ。）ブロックがどのように呼び出され、結果がどのように使われるかはコンテキストの問題だが、クロージャは内部で全て同じに動作する。

source: (That is, it is a Mu method, not a Failure method.
ja: （すなわち、それはMuメソッドで、Failureメソッドではない。

source: (The repeat keyword forces the conditional to be evaluated at the end of the loop, so it's still C's do-while semantics.) Therefore, even under GNU style rules, the previous example may be rewritten into a very clear:
ja: （repeatキーワードは条件文をループの終わりで評価するようにさせるので、それはまだ C言語のdo-whileセマンティクスだ。）したがって、GNUスタイルの規則でさえ、前の例はとてもわかりやすく書きなおされるだろう。

source: (The while's declaration of $line continues to be visible past the end of the block.
ja: （whileの$lineの宣言はブロックの終わりを過ぎても見え続ける。

source: (The Failure may, however, be stored in any container whose type allows the Failure role to be mixed in.) The .handled method returns False on failures that have not been handled.
ja: （Failureはおそらく、どんな方法でも、Failureロールをミックスインされるために型が許可される何か一つのコンテナに格納される。）.handledメソッドはハンドルされたことのない失敗でFalseを返す。

source: (The difference between Perl 5 and Perl 6 in this respect arises only because Perl 5 didn't have user-defined control structures, hence the sub's lexical scope was always the innermost dynamic scope, so the preference to the lexical scope in the current sub was implicit.
ja: （この関係のPerl 5とPerl 6の間の違いは唯一発生する。なぜならPerl 5はユーザー定義の制御構造を持たず、それゆえにsubのレキシカルスコープは常に最も深いダイナミックスコープのようなので、現在のsubのレキシカルスコープの優先傾向は暗黙だ。

source: (The fat arrow => separates key and value in a Pair.)
ja: （太い矢印=>はキーと値をPairに区切ります。）

source: (Think especially about how to avoid collisions in "diamond dependencies", where a Task has two different dependencies which in turn have the same dependency.)
ja: （特にTaskが同じ従属物を持つ2つの異なる従属物を保つ場合に“ダイアモンド従属物”でどのように衝突を避けるか考えてください。）

source: (This implies that there are some errors that would ordinarily be found at compile time that cannot be found until we know what the caller's lexical scope looks like at run time.
ja: （これはいくつかのエラーがあることを伴う。それは通常はコンパイル時に見つかり、我々が実行時のように見える呼び出し元のどのレキシカルスコープか知るまで見つからない。

source: (This is autovivification).
ja: （これは自動有効化です。）

source: (This is the only situation in which a cycle can occur.) This requires the addition of a helper method depends-on, which checks whether a task depends on another one, either directly or transitively.
ja: （これは循環が起こることがありえる唯一の状況です。）これは、ヘルパーメソッドdepends-on（それはタスクが別のものに依存するかどうか調べます）の追加を直接、または、他動的に必要とします.

source: (This only works for one-way coercion, so you may not declare any rw parameter with a coercive type.) The type outside the parens indicates the desired end result, and subsequent code may depend on it being that type.
ja: （これは一方通行の強制のためだけに動作するので、あなたは制約型でrwパラメータを宣言しないでしょう。）括弧の外の型は望んでいる結果を示し、以降のコードはその型によって決まります。

source: (Use print if you don't want the newline at the end.)
ja: （終わりに改行文字が不要ならprintを使ってください。）

source: (Using the term "label" loosely, to include other solutions besides the label syntax, such as .gather and .take methods on some identity object.)]
ja: （「ラベル」という語句を緩く使う、ラベル文法に加えて他の解決策を付け加える、いくつかの識別オブジェクトでの.gatherと.takeメソッドのような 。）］

source: (You can always establish a lexical scope explicitly by using the block form of argument.) As statement introducers, all these keywords must be followed by whitespace.
ja: （ブロック形式の引数を使うことでいつでもレキシカルスコープを確立することができる。）文をもたらすものによって、これらすべてのキーワードは空白が続かなければならない。

source: (You can say something like try({...}), but then you are calling the try() function using function call syntax instead, and since Perl does not supply such a function, it will be assumed to be a user-defined function.) For purposes of flow control, none of these forms are considered loops, but they may easily be applied to a normal loop.
ja: （あなたはtry({...})のような何かを書くことができる。しかしtry()関数を代わりに関数呼び出し文法で使い、Perlがそのような関数を供給しないので、それはユーザー定義の関数と仮定されるだろう。）フロー制御の目的のためにこれらの形式はループと見なされないが、これらは通常のループに簡単に適用出来る。

source: (You could write a macro that violates this, but resist the urge.) Variables that mediate between an outer statement and an inner block (such as loop variables) should generally be declared as formal parameters to that block.
ja: （あなたはこれを犯すマクロを書くことが可能だが、衝動を抑えてくれ。）外側の文と内側のブロック（ループ変数のような）の間を仲介する変数は一般的にはそのブロックの仮パラメータとして宣言されるべきだ。

source: (loosest precedence)
ja: （最も低い優先順位）

source: (tightest precedence)
ja: （最もタイトな順位）

source: -1 for negative, 0 for zero, 1 for positive values
ja: 負数なら-1、ゼロなら0、正の値なら1

source: ... already contains three different operators: =, =>, and ,.
ja: は既に3つの異なる演算子を含んでいます：=、=>、そして,です。

source: ... amount of X characters.
ja: ... X文字数の総計。

source: ... an undefined value dispatches to the second candidate.
ja: ... 未定義値は第2候補としてディスパッチします。

source: ... and you'd better not misplace your new $world if it's temporary, as it's the only one you're going to get.
ja: …そしてもし新しい$worldが一時変数なら、それを置き忘れないほうがいいです。それはあなたが得るただひとつのものです。

source: ... into:
ja: を以下に：

source: ... so that @scores will contain only one item.
ja: それで、@scoresは1つのアイテムだけ含むでしょう。

source: ... the name of the sub is panic.
ja: サブルーチンの名前はpanicです。

source: ... the right-hand side of the assignment produces a list (because of the , operator) that is made of pairs (because of =>), and the result is then assigned to the array variable.
ja: 右側の割り当てはリストを生成し、（,演算子によって）それはペアでできています（=>によって）、そして結果は配列変数に割り当てられます。

source: ... would win against (::T, T).
ja: ... は(::T, T)に対して勝ちます。

source: link lists possible Pair forms and their meanings.
ja: リンクは可能なPairの形式と意味をリストにまとめています。

source: != is really just a convenience for !==, which in turn is really the ! meta operator added to the infix == operator.
ja: !=は本当に!==のための便宜です。それは本当に次々に!メタ演算子を接中辞==演算子に加えたものです。

source: $ always means a scalar variable, @ an array variable, and % a hash variable, even when subscripting.
ja: $は常にスカラー変数、@は配列変数、%はハッシュ変数を意味します（たとえ添字付けの場合でも）。

source: $length defaults to the rest of the string
ja: $lengthはデフォルトで文字列の残りになります

source: $o.perl returns a string that can be executed as Perl code, and reproduces the original object $o.
ja: $o.perlはPerlコードとして実行可能な文字列を返し、最初のオブジェクト$oを再現します。

source: $pairing gets the first item of the returned list, and $result the second.
ja: $pairingは返されたリストの最初のアイテム、$resultは2番目のアイテムを得ます。

source: $thing++ is short for $thing += 1 or $thing = $thing + 1, with the small exception that the return value of the expression is $thing before the increment, not the incremented value.
ja: $thing++は$thing += 1または$thing = $thing + 1の短縮形です。小さな例外として、式の戻り値はインクリメントされる前の$thingです。インクリメント後の値ではありません。

source: 'scores' is a string literal.
ja: 'scores'は文字列リテラルです。

source: += $r1 means increase the value in the variable on the left by $r1.
ja: += $r1は$r1によって左の変数の値を増やすことを意味します。

source: .+ greedily calls all methods but dies unless it can call at least one method.
ja: .+は貪欲にすべてのメソッドを呼びますが、少なくとも1つのメソッドを呼び出せないとdieします。

source: A and B are abstract; how about Integer and Positive Integer?
ja: AとBは、抽象的です；IntegerとPositive Integerはどうですか？

source: Complex numbers have two parts: a real part and an imaginary part.
ja: Complex数は、2つの部分を持ちます：実数部分と虚数部分です。

source: Int ~~ Num is subject to change, so currently I can't think of a good idea with builtin types - any other idea?
ja: Int ~~ Numは変更されることがあるので、現在私は組み込まれた型 ― 何の他の考えも ― で良い考えについて考えることができません。

source: Int automatically supports promotion to arbitrary precision, as well as holding Inf and NaN values.
ja: IntはInf値とNaN値だけでなく、随意精度への昇格を自動的にサポートします。

source: Int objects store integer numbers of arbitrary size.
ja: Intオブジェクトは、任意のサイズの整数を格納します。

source: MAIN routines can also be multis.
ja: MAINルーチンもマルチになれます。

source: Num is the floating point type.
ja: Numは、浮動小数点型です。

source: Num must support the largest native floating point format that runs at full speed.
ja: Numは最大速度で実行できるもっとも大きいネイティブの浮動小数点フォーマットをサポートしなければなりません。

source: Numeric Types
ja: Numeric型

source: Rat supports extended precision rational arithmetic.
ja: Ratは拡張精度有理数演算をサポートします。

source: Rat, short for rational, stores fractional numbers without loss of precision.
ja: Rat（rational、有理数の省略）は、精度を損なわずにわずかな数を格納します。

source: for produces a loop that runs the block delimited by curly brackets once for each item of the list, setting the variable $line to the current value of each iteration.
ja: forはリストの各項目のために、中括弧によって区切られるブロックを実行するループを生み出します。そして、変数$lineに各々の繰り返しの現在の値をセットします。

source: my Dog $spot by itself does not automatically call a Dog constructor.
ja: my Dog $spotはそれ自体でDogのコンストラクタを呼びません。

source: my can declare multiple variables simultaneously.
ja: myは同時に複数の変数を宣言できます。

source: my declares a lexical variable.
ja: myはレキシカル変数を宣言します。

source: our also makes subroutines visible from the outside of a package or module:
ja: ourはパッケージかモジュールの外からもサブルーチンを見えるようにします。

source: return has the additional effect of immediately exiting the subroutine:
ja: 加えて、returnはサブルーチンを直ちに抜け出すという効果を持っています：

source: sort sorts in ascending order, from smallest to largest.
ja: sortは昇順に、最小から最大にソートします。

source: split decomposes its invocant into a list of strings, so that joining the list items with the separator ' | ' produces the original string.
ja: splitはそのインボカントを文字列のリストに分解します。したがって、リストのアイテムをセパレーター' | 'で連結すると最初の文字列になります。

source: » is a hyper operator.
ja: »はハイパー演算子です。

source: ｻ is a hyper operator.
ja: »はハイパー演算子です。

source: Nil.Stringy and Nil.Str throw a resumable warning that returns a value of '' on resumption.
ja: Nil.StringyとNil.Strは再開時に''の値を返すレジューム可能な警告をスローします。

source: Nil.Numeric likewise throws a resumable warning that returns 0 on resumption.
ja: Nil.Numericは同様に再開時に0を返すレジューム可能な警告をスローします。

source: $! would then be sugar for @![0].
ja: $!はその時@![0]のシュガーだ。

source: %sets stores the number of sets each player has won.
ja: %setsは、各々のプレーヤーが獲得したセットの数を格納します。

source: &logarithm.signature returns the signature associated with the subroutine, and calling .params on the signature returns a list of Parameter objects.
ja: &logarithm.signatureはサブルーチンに結び付けられたシグネチャーを返します。そして.paramsをシグネチャーで呼び出すとParameterオブジェクトのリストを返します。

source: .?, tries to call one method, but returns a Failure rather then throwing an exception.
ja: .?は1つのメソッドを呼ぼうとしますが、例外をスローするよりもFailureを返します。

source: IRCBot does the latter; it IRCBot defines an attribute $!bot-nick along with an accessor method.
ja: IRCBotは後者をします；それは、アクセサメソッドとともに属性$!bot-nickをIRCBotに定義します。

source: Nil.defined returns False (whereas ().defined returns True).
ja: Nil.definedはFalseを返します（対して().definedはTrueを返します）。

source: m/ \w+: 'en'/ can never match any string, because the \w+ always eats up all word characters and never releases them.
ja: \w+は常にすべてのワード文字を食い尽くして、それらを決してリリースしないので、m/ \w+: 'en'/は何の文字列にも決してマッチすることができません。

source: to-json has many candidates; these subs all have the name to-json but differ in their signatures.
ja: to-jsonは多くの候補を持ちます；これらのsubsは全てto-jsonという名前を持ちますが、シグネチャーは異なります。

source: $! is a convenient link to the last failure, and only ever contains one exception, the most recent.
ja: $!は最後の失敗への便利なリンクで、一つだけの最も最近の例外を含む。

source: [max] 1, 5, 3, 7 is the same as 1 max 5 max 3 max 7 and evaluates to 7.
ja: [max] 1, 5, 3, 7は1 max 5 max 3 max 7と同じで、7と評価します。

source: m/ ^a / matches strings beginning with an a, and m/ ^ a $ / matches strings that consist only of an a.
ja: m/ ^a /はaで始まる文字列にマッチし、m/ ^ a $ /は aだけから成る文字列にマッチします。

source: $/.values returns a list of all captures, here either the object or the array capture.
ja: $/.valuesはすべてのキャプチャーのリストを返します。ここでは、objectかarrayのキャプチャーです。

source: $0, $1, $2, etc., are aliases into the $/ object.
ja: $0、$1、$2などは$/オブジェクトの別名です。

source: $file.lines produces a list of the lines read from the file scores, starting with the line where the previous calls to $file.get left off, and going all the way to the end of the file.
ja: $file.linesはファイルscoresから読み込まれる行のリストを生成します。前の$file.getの呼び出しで読み込んだ行は捨てられ、ファイルの終わりまでいきます。

source: != returns True if the two objects differ in their numerical value.
ja: !=は、もし2つのオブジェクトが数値で異なるならTrueを返します。

source: "hello" === "hello" is true because both strings are immutable and have the same value.
ja: "hello" === "hello"は真です。なぜなら両方の文字列は不変で同じ値を持つからです。

source: .value returns the value of the current pair, ($unit * .value) multiplies that values with $unit, and 'X' x ($unit * .value) returns as that many X characters.
ja: .valueは現在のペアの値を返します。($unit * .value)は値と$unitの積、そして'X' x ($unit * .value)はたくさんのX文字を返します。

source: @scores».key is a list of all the keys of the pair objects in @scores, and @scores».key».chars is a list of the length of all keys in @scores.
ja: @scores».keyは@scoresの中のペアオブジェクトのすべてのキーのリスト、そして@scores».key».charsは@scoresの中の全てのキーの長さのリストです。

source: @scoresｻ.key is a list of all the keys of the pair objects in @scores, and @scoresｻ.keyｻ.chars is a list of the length of all keys in @scores.
ja: @scores».keyは@scores内の全てのペアオブジェクトのキーのリストです。そして@scores».key».charsは@scores内のキーの長さのリストです。

source: dup also has a subrule called word.
ja: dupはwordと呼ばれるサブルールも持っています。

source: words is also a method, called on the string returned from get.
ja: wordsもメソッドです。getから返される文字列に対して呼び出されます。

source: Nil.so also returns False.
ja: Nil.soもFalseを返します。

source: Nil also indicates a failed match.
ja: Nilは失敗したマッチも示します。

source: \w+ gives up one character to match oxe.
ja: \w+は1つの文字をマッチoxeにゆずります。

source: decode goes the other direction.
ja: decodeは他の命令に行きます。

source: words decomposes its invocant--the string on which it operates--into a list of words, which here means strings without whitespace.
ja: wordsはそのインボカントを分解し、文字列を空白を含まない単語のリストにします。

source: Nil.ACCEPTS always returns Nil.
ja: Nil.ACCEPTSは常にNilを返します。

source: en still can't match, so the \w+ group again gives up one character and now matches ox.
ja: enはまだマッチすることができないので、\w+グループは再び1つの文字をあきらめて、現在oxにマッチします。

source: Nil.perl and Nil.gist return 'Nil'.
ja: Nil.perlとNil.gistは'Nil'を返します。

source: Precedence rules govern how a parser will parse this line.
ja: 優先順位規則はパーサーがこの行を解析する方法を制御します。

source: 1. The input format of the example program is redundant: the first line containing the name of all players is not necessary, because you can find out which players participated in the tournament by looking at their names in the subsequent rows.
ja: 1. プログラム例の入力フォーマットは冗長です：後の列で彼らの名前を見ることによってどのプレイヤーがトーナメントに参加したのか知ることができるので、全てのプレイヤーの名前を含む最初の行は必要ありません。

source: 1. The method add-dependency in Task permits the creation of cycles in the dependency graph.
ja: 1.Taskのメソッドadd-dependencyは従属グラフの中で循環を許します。

source: 2. Instead of removing the redundancy, you can also use it to warn if a player appears that wasn't mentioned in the first line, for example due to a typo.
ja: 2. 冗長性を取り除く代わりに、最初の行で言及されなかったプレーヤーが現れた場合に、それを警告するために（たとえばtypoのため）使うこともできます。

source: 2. Is there a way to detect the presence of a cycle during the course of a perform call?
ja: 2. perform呼び出し中に循環の存在を見つける方法がありますか？

source: 3. How could Task objects execute their dependencies in parallel?
ja: 3.Taskオブジェクトはどのように並列に彼らの従属物を実行することができますか？

source: Answer: Enabling parallelism is easy; change the line .perform() for @!dependencies; into @!dependencies».perform().
ja: 答え：並列化を有効にするのは簡単です；.perform() for @!dependencies;の行を@!dependencies».perform()に変えてください。

source: Answer: Introduce another hash with the names of the legitimate players as keys, and look in this hash when the name of a player is read:
ja: 答え：プレイヤーの名前が読み込まれるとき、キーとして正当なプレイヤーの名前で別のハッシュを導入して、このハッシュを見てください：

source: Answer: Remove the line my @names = $file.get.words;, and change:
ja: 答え：my @names = $file.get.words;の行を取除き、次のように変えます：

source: Answer: To detect the presence of a cycle during a perform call, keep track of which Tasks have started; prevent a Task from starting twice before finishing:
ja: 答え：perform呼び出しの間、循環の存在を見つけるために、Taskが始まったトラックを保ってください；Taskが以下を終える前に二回始まるのを防いでください：

source: Answer: You can create two tasks, and then "short-circuit" them with add-dependency:
ja: 答え：あなたは2つのタスクを作ることができ、そしてadd-dependencyによって「短縮させます」：

source: A CATCH block handles only "bad" exceptions, and lets control exceptions pass unhindered.
ja: CATCHブロックは「悪い」例外だけ扱う。そして制御例外を妨げられないようにパスさせる。

source: A CATCH block is just a trait of the closure containing it, and is automatically called at the appropriate moment.
ja: CATCHブロックはそれを含むクロージャのただのトレイトだ。そして適切な時に自動的に呼ばれる。

source: A CATCH block sees the lexical scope in which it was defined, but its caller is the dynamic location that threw the exception.
ja: CATCHブロックはそれが定義されたレキシカルスコープをみる。しかしその呼び出し元は例外を投げたダイナミックロケーションだ。

source: A Str is a Unicode string object.
ja: Strはユニコード文字列オブジェクトです。

source: A gather is not considered a loop, but it is easy to combine with a loop statement as in the examples above.
ja: gatherはループと見なされないが、上述した例におけるループ文に結合するのは簡単だ。

source: A return always exits from the lexically surrounding sub or method definition (that is, from a function officially declared with the sub, method, or submethod keywords).
ja: returnは常にレキシカルに囲っているsubまたはメソッドの定義から抜け出る（すなわち、sub、method、またはsubmethodキーワードで正式に定義されている機能から）。

source: A return, for example, is considered a form of abnormal control flow, since it can jump out of multiple levels of closures to the end of the scope of the current subroutine definition.
ja: 例えばreturnはアブノーマルな制御フローの形式と見なされる。だからそれは多数のレベルのクロージャから現在のサブルーチンの定義のスコープの終端までジャンプできる。

source: A Hash is an unordered collection of key-value pairs.
ja: Hashはキーと値のペアの無順序のコレクションです。

source: A do is unnecessary immediately after any opening bracket as the syntax inside brackets is a semicolon-separated list of statements, so the above can in fact be written:
ja: doはブラケット内のセミコロンで分けられたリスト文の文法として開始ブラケットの後に直ちには必要ない。なので上述したものは実際は書き直すことができる：
